Revit 2024 API
ExternalGeometryId.IsValidExternalGeometryId Method
 Checks whether a given string represents a valid ExternalGeometryId or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static bool IsValidExternalGeometryId(
	string externalGeometryId
)
Visual Basic
Public Shared Function IsValidExternalGeometryId ( _
	externalGeometryId As String _
) As Boolean
Visual C++
public:
static bool IsValidExternalGeometryId(
	String^ externalGeometryId
)
Parameters
externalGeometryId
Type: System.String
 A string that represents an identifier for an external geometry.
Return Value
 True if the string represents a valid ExternalGeometryId, false otherwise.
Remarks
 Any non-empty string is a valid ExternalGeometryId.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExternalGeometryId Class
Autodesk.Revit.DB Namespace